restaurant/ssl/Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Поставки</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиРесурсов</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьРесурсов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНакладной</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ингредиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

restaurant/ssl/Catalogs/Поставщики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Поставщики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

restaurant/ssl/Documents/ПриходнаяНакладная/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПриходнаяНакладная.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходнаяНакладная.Дата КАК Дата,
	|	ПриходнаяНакладная.Номер КАК Номер,
	|	ПриходнаяНакладная.Поставщик КАК Поставщик,
	|	ПриходнаяНакладная.Ресторан КАК Ресторан,
	|	ПриходнаяНакладная.Тип КАК Тип,
	|	ПриходнаяНакладная.Сведения.(
	|		НомерСтроки КАК НомерСтроки,
	|		Название КАК Название,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Сведения,
	|	ПриходнаяНакладная.Оплата КАК Оплата,
	|	Поставщики.КонтактноеЛицо КАК КонтактноеЛицо,
	|	Поставщики.Адрес КАК Адрес,
	|	Поставщики.Телефон КАК Телефон,
	|	Поставщики.Фото КАК Фото,
	|	Поставщики.Подпись КАК Подпись
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Поставщики КАК Поставщики
	|		ПО ПриходнаяНакладная.Поставщик = Поставщики.Ссылка
	|ГДЕ
	|	ПриходнаяНакладная.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСведенияШапка = Макет.ПолучитьОбласть("СведенияШапка");
	ОбластьСведения = Макет.ПолучитьОбласть("Сведения");
	Подвал = Макет.ПолучитьОбласть("Подвал");      
	Разделитель = Макет.ПолучитьОбласть("Разделитель");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;          
		 // Вывод логотипа
		Если НЕ Выборка.Фото.Пустая() Тогда
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Фото);
			Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
				КартинкаЛоготип = Новый Картинка(ДвоичныеДанные);
				ОбластьЗаголовок.Рисунки.Логотип.Картинка = КартинкаЛоготип;
			КонецЕсли;
		КонецЕсли;    
		Если НЕ Выборка.Подпись.Пустая() Тогда
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Подпись);
			Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
				КартинкаПодпись = Новый Картинка(ДвоичныеДанные);
				Подвал.Рисунки.Подпись.Картинка = КартинкаПодпись;
			КонецЕсли;
		КонецЕсли;
		
		Номер = Выборка.Номер;
		Дата = Выборка.Дата;
        Ресторан = Выборка.Ресторан;
		Адрес = Выборка.Адрес;
		Телефон = Выборка.Телефон;     
		Поставщик = Выборка.Поставщик;
		КонтактноеЛицо = Выборка.КонтактноеЛицо;  
		ОбластьЗаголовок.Параметры.Номер = Номер;
		ОбластьЗаголовок.Параметры.Дата = Дата;
		ОбластьЗаголовок.Параметры.Ресторан = Ресторан; 
		ОбластьЗаголовок.Параметры.Поставщик = Поставщик;
		ОбластьЗаголовок.Параметры.Адрес = Адрес;
		ОбластьЗаголовок.Параметры.Телефон = Телефон;
		ОбластьЗаголовок.Параметры.КонтактноеЛицо = КонтактноеЛицо;
		ТабДок.Вывести(ОбластьЗаголовок); 
		Тип = Выборка.Тип;
        ОбластьСведения.Параметры.Тип = Тип;
		//Шапка.Параметры.Заполнить(Выборка);
		//ТабДок.Вывести(Шапка, Выборка.Уровень());
        СуммаИтог = 0;
		ТабДок.Вывести(ОбластьСведенияШапка);
		ВыборкаСведения = Выборка.Сведения.Выбрать();
		Пока ВыборкаСведения.Следующий() Цикл
			ОбластьСведения.Параметры.Заполнить(ВыборкаСведения); 
			ТабДок.Вывести(ОбластьСведения, ВыборкаСведения.Уровень());   
			СуммаИтог = СуммаИтог + ВыборкаСведения.Сумма;
		КонецЦикла;
        ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		Подвал.Параметры.Ответственный = ТекПользователь;    
		Подвал.Параметры.ВсегоПоДокументу = Строка(СуммаИтог) + " ₽";
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
        ТабДок.Вывести(Разделитель);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
